% Задаем матрицы A, F, A_d, F_d
A=[0 0 1 0;0 0 0 1;0 -0.1134104046 0 0;0 6.615606936 0 0];
F = diag([-1,-2,-1.5, -0.5]);
Fd = diag([0.5, 0.8, 0.3, 0.2]);
Ad = [
  1.0, -0.00131165, 0.1511355, -0.00006574791;
   0,    1.076513,         0,      0.1549708;
   0,  -0.0175753,       1.0,    -0.00131165;
   0,    1.025226,         0,       1.076513;
];

I = eye(4); 

W = kron(I, A) - kron(F.', I);

Wd = kron(I, Ad) - kron(Fd.', I);

% Вывод результатов
disp('Матрицы W для непрерывной модели:');
W1 = W(1:4, 1:4);
W2 = W(5:8, 5:8);
W3 = W(9:12, 9:12);
W4 = W(13:16, 13:16);
disp('Блок W1:');
disp(W1);
disp('Блок W2:');
disp(W2);
disp('Блок W3:');
disp(W3);
disp('Блок W4:');
disp(W4);

disp('Матрица W_d для дискретной модели:');
Wd1 = Wd(1:4, 1:4);
Wd2 = Wd(5:8, 5:8);
Wd3 = Wd(9:12, 9:12);
Wd4 = Wd(13:16, 13:16);
disp('Блок Wd1:');
disp(Wd1);
disp('Блок Wd2:');
disp(Wd2);
disp('Блок Wd3:');
disp(Wd3);
disp('Блок Wd4:');
disp(Wd4);
